# Вариант 16.
#Три цветовода выращивают розы. Определить, какие из известных сортов роз «Анжелика»,
#«Виктория», «Гагарин», «Катарина», «Юбилейная», «Южная» имеются у каждого
#ветоводы, есть хотя бы у одного из цветоводов и каких нет ни у одного из цветоводов.

g1 = {'Анжелика', 'Виктория', 'Гагарин'}          
g2 = {'Анжелика', 'Гагарин', 'Катарина', 'Южная'} 
g3 = {'Анжелика', 'Виктория', 'Юбилейная'}        

all_varieties = {'Анжелика', 'Виктория', 'Гагарин', 'Катарина', 'Юбилейная', 'Южная'}

print('Сорта у всех цветоводов:', g1 & g2 & g3)

print('Сорта хотя бы у одного:', g1 | g2 | g3)

print('Сорта отсутствуют у всех:', all_varieties - (g1 | g2 | g3))
