#Даны три целых числа: A, B, C. Проверить истинность высказывания: «Ровно два из чисел A, B, C являются положительными».

while True:
    try:
        a = int(input('Введите первое целое число: '))
        b = int(input('Введите второе целое число: '))
        c = int(input('Введите третье целое число: '))
        break
    except ValueError:
        print("Все числа должны быть целыми")

k = 0
if a > 0: k += 1
if b > 0: k += 1
if c > 0: k += 1

print("Ровно два числа положительные5", k == 2)
