#Даны три целых числа, одно из которых отлично от двух других, равных между собой. Определить порядковый номер числа, отличного от остальных
while True:
    try:
        a = int(input('Введите первое целое число: '))
        b = int(input('Введите второе целое число: '))
        c = int(input('Введите третье целое число: '))
        break
    except ValueError:
        print("Число должно быть целым")
if a == b and a != c:
    print("Третье число отлично от остальных")
elif a == c and a != b:
    print("Второе число отлично от остальных")
elif b == c and b != a:
    print("Первое число отлично от остальных")
else:
    print("Ошибка: нет одного отличного числа среди двух равных")
