#Даны три целых числа, одно из которых отлично от двух других, равных между собой. Определить порядковый номер числа, отличного от остальных
while True:
    try:
        a = int(input('Введите первое целое число: '))
        b = int(input('Введите второе целое число: '))
        c = int(input('Введите третье целое число: '))
        break
    except ValueError:
        print("Все числа должны быть целыми!")

if a == b and a != c:
    print("Отличное число на позиции 3")
elif a == c and a != b:
    print("Отличное число на позиции 2")
elif b == c and b != a:
    print("Отличное число на позиции 1")
else:
    print("Нет одного отличного числа")
